chenyan2010/stm32fortouch/User/src/usb_prop.c
/******************** (C) COPYRIGHT 2011 STMicroelectronics ********************
* File Name          : usb_prop.c
* Author             : MCD Application Team
* Version            : V3.3.0
* Date               : 21-March-2011
* Description        : All processings related to Custom HID Demo
********************************************************************************
* THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
* WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE TIME.
* AS A RESULT, STMICROELECTRONICS SHALL NOT BE HELD LIABLE FOR ANY DIRECT,
* INDIRECT OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING FROM THE
* CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE CODING
* INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
*******************************************************************************/

/* Includes ------------------------------------------------------------------*/
#include <stdio.h>

#include "stm32f10x.h"
#include "usb_lib.h"
#include "usb_conf.h"
#include "usb_prop.h"
#include "usb_desc.h"
#include "usb_pwr.h"
#include "hw_config.h"

#include "global_data.h"
/* Private typedef -----------------------------------------------------------*/
/* Private define ------------------------------------------------------------*/
/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/

uint8_t Receive_finish;
uint8_t Transceive_finish;

uint32_t ProtocolValue;
uint8_t HID_GetReport_Value[2];
uint8_t HID_SetReport_Value[3];

/* -------------------------------------------------------------------------- */
/*  Structures initializations */
/* -------------------------------------------------------------------------- */

DEVICE Device_Table =
  {
    EP_NUM,
    1
  };

DEVICE_PROP Device_Property =
  {
    CustomHID_init,
    CustomHID_Reset,
    CustomHID_Status_In,
    CustomHID_Status_Out,
    CustomHID_Data_Setup,
    CustomHID_NoData_Setup,
    CustomHID_Get_Interface_Setting,
    CustomHID_GetDeviceDescriptor,
    CustomHID_GetConfigDescriptor,
    CustomHID_GetStringDescriptor,
    0,
    0x40 /*MAX PACKET SIZE*/
  };

USER_STANDARD_REQUESTS User_Standard_Requests =
  {
    CustomHID_GetConfiguration,
    CustomHID_SetConfiguration,
    CustomHID_GetInterface,
    CustomHID_SetInterface,
    CustomHID_GetStatus,
    CustomHID_ClearFeature,
    CustomHID_SetEndPointFeature,
    CustomHID_SetDeviceFeature,
    CustomHID_SetDeviceAddress
  };

ONE_DESCRIPTOR Device_Descriptor =
  {
    (uint8_t*)CustomHID_DeviceDescriptor,
    CUSTOMHID_SIZ_DEVICE_DESC
  };

ONE_DESCRIPTOR Config_Descriptor =
  {
    (uint8_t*)CustomHID_ConfigDescriptor,
    CUSTOMHID_SIZ_CONFIG_DESC
  };

ONE_DESCRIPTOR CustomHID_Report_Descriptor =
  {
    (uint8_t *)CustomHID_ReportDescriptor,
    CUSTOMHID_SIZ_REPORT_DESC
  };
#if 0
ONE_DESCRIPTOR CustomHID_Mouse_Report_Descriptor =
  {
    (uint8_t *)CustomHID_Mouse_ReportDescriptor,
    CUSTOMHID_SIZ_MOUSE_REPORT_DESC
  };
#endif

ONE_DESCRIPTOR CustomHID_Hid_Descriptor =
  {
    (uint8_t*)CustomHID_ConfigDescriptor + CUSTOMHID_OFF_HID_DESC,
    CUSTOMHID_SIZ_HID_DESC
  };
#if 0

ONE_DESCRIPTOR CustomHID_Hid_Descriptor1 =
  {
    (uint8_t*)CustomHID_ConfigDescriptor + CUSTOMHID_OFF_HID_DESC1,
    CUSTOMHID_SIZ_HID_DESC
  };


ONE_DESCRIPTOR CustomHID_Hid_Descriptor2 =
  {
    (uint8_t*)CustomHID_ConfigDescriptor + CUSTOMHID_OFF_HID_DESC2,
    CUSTOMHID_SIZ_HID_DESC
  };
#endif


ONE_DESCRIPTOR String_Descriptor[4] =
  {
    {(uint8_t*)CustomHID_StringLangID, CUSTOMHID_SIZ_STRING_LANGID},
    {(uint8_t*)CustomHID_StringVendor, CUSTOMHID_SIZ_STRING_VENDOR},
    {(uint8_t*)CustomHID_StringProduct, CUSTOMHID_SIZ_STRING_PRODUCT},
    {(uint8_t*)CustomHID_StringSerial, CUSTOMHID_SIZ_STRING_SERIAL}
  };

/* Extern variables ----------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* Extern function prototypes ------------------------------------------------*/
/* Private functions ---------------------------------------------------------*/

/*******************************************************************************
* Function Name  : CustomHID_init.
* Description    : Custom HID init routine.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_init(void)
{

  /* Update the serial number string descriptor with the data from the unique
  ID*/
  Get_SerialNum();

  pInformation->Current_Configuration = 0;
  /* Connect the device */
  PowerOn();

  /* Perform basic device initialization operations */
  USB_SIL_Init();
	
  bDeviceState = UNCONNECTED;
	 Receive_finish = 0;
 	Transceive_finish = 0;
}

/*******************************************************************************
* Function Name  : CustomHID_Reset.
* Description    : Custom HID reset routine.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_Reset(void)
{
  /* Set Joystick_DEVICE as not configured */
  pInformation->Current_Configuration = 0;
  pInformation->Current_Interface = 0;/*the default Interface*/

  /* Current Feature initialization */
  pInformation->Current_Feature = CustomHID_ConfigDescriptor[7];

//#ifdef STM32F10X_CL  --- 
  /* EP0 is already configured in DFU_Init() by USB_SIL_Init() function */
  
  /* Init EP1 IN as Interrupt endpoint */
//  OTG_DEV_EP_Init(EP1_IN, OTG_DEV_EP_TYPE_INT, 4);---
//#else ---

     SetBTABLE(BTABLE_ADDRESS);

  /* Initialize Endpoint 0 */
	  SetEPType(ENDP0, EP_CONTROL);
	  SetEPTxStatus(ENDP0, EP_TX_STALL);
	  SetEPRxAddr(ENDP0, ENDP0_RXADDR);
	  SetEPTxAddr(ENDP0, ENDP0_TXADDR);
	  Clear_Status_Out(ENDP0);
	  SetEPRxCount(ENDP0, Device_Property.MaxPacketSize);
	  SetEPRxValid(ENDP0);

  /* Initialize Endpoint 1 */
	SetEPType(ENDP1, EP_INTERRUPT);
  	SetEPTxAddr(ENDP1, ENDP1_TXADDR);
  	SetEPRxAddr(ENDP1, ENDP1_RXADDR);
  	SetEPTxCount(ENDP1, EP1_TXBUF);
 	 SetEPRxCount(ENDP1, EP1_RXBUF);
  	SetEPRxStatus(ENDP1, EP_RX_VALID);
  	SetEPTxStatus(ENDP1, EP_TX_NAK);
	

     bDeviceState = ATTACHED;
  
  /* Set this device to response on default address */
     SetDeviceAddress(0);
//#endif /* STM32F10X_CL */---

//  bDeviceState = ATTACHED;---
}
/*******************************************************************************
* Function Name  : CustomHID_SetConfiguration.
* Description    : Udpade the device state to configured and command the ADC 
*                  conversion.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_SetConfiguration(void)
{
  if (pInformation->Current_Configuration != 0)
  {
    /* Device configured */
    bDeviceState = CONFIGURED;
    
    /* Start ADC1 Software Conversion */ 

//    ADC_SoftwareStartConvCmd(ADC1, ENABLE);

  }
}
/*******************************************************************************
* Function Name  : CustomHID_SetDeviceAddress.
* Description    : Udpade the device state to addressed.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_SetDeviceAddress (void)
{
  bDeviceState = ADDRESSED;
}
/*******************************************************************************
* Function Name  : CustomHID_Status_In.
* Description    : Joystick status IN routine.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_Status_In(void)
{
  if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
    && pInformation->USBbRequest == GET_REPORT
	&& pInformation->ControlState == WAIT_STATUS_IN)
  {
    Transceive_finish = 1;
  }
}

/*******************************************************************************
* Function Name  : CustomHID_Status_Out
* Description    : Joystick status OUT routine.
* Input          : None.
* Output         : None.
* Return         : None.
*******************************************************************************/
void CustomHID_Status_Out (void)
{
  if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
    && pInformation->USBbRequest == SET_REPORT
	&& pInformation->ControlState == WAIT_STATUS_IN)
  {
    Receive_finish = 1;
  }
}

/*******************************************************************************
* Function Name  : CustomHID_Data_Setup
* Description    : Handle the data class specific requests.
* Input          : Request Nb.
* Output         : None.
* Return         : USB_UNSUPPORT or USB_SUCCESS.
*******************************************************************************/
RESULT CustomHID_Data_Setup(uint8_t  RequestNo)
{
  uint8_t *(*CopyRoutine)(uint16_t);

  CopyRoutine = NULL;

   /* GET_DESCRIPTOR */
  if ((RequestNo == GET_DESCRIPTOR)
      && (Type_Recipient == (STANDARD_REQUEST | INTERFACE_RECIPIENT))
      && (pInformation->USBwIndex0 == 0))
  {
    if (pInformation->USBwValue1 == REPORT_DESCRIPTOR)
    {
    	CopyRoutine = CustomHID_GetReportDescriptor;
    }
    else if (pInformation->USBwValue1 == HID_DESCRIPTOR_TYPE)
    {
	    CopyRoutine = CustomHID_GetHIDDescriptor;
    }
  }
  /*** GET_PROTOCOL ***/
  else if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
           && RequestNo == GET_PROTOCOL)
  {
    CopyRoutine = CustomHID_GetProtocolValue;
  }
  /*** GET_REPORT ***/
  else if((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
        && RequestNo == GET_REPORT)
  {
  		if(pInformation->USBwValue1 == HID_FEATURE)// && !GetReportFlag)          // report type
        {
            CopyRoutine = CustomHID_GetReport_Feature;
  		}    
  }
  /**** SET_REPORT ****/
  else if((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
        && RequestNo == SET_REPORT)
  {
  		
  		if(pInformation->USBwValue1 == HID_FEATURE)          // report type
        {
            CopyRoutine = CustomHID_SetReport_Feature;
  		}    
  }

  if (CopyRoutine == NULL)
  {
    return USB_UNSUPPORT;
  }

  pInformation->Ctrl_Info.CopyData = CopyRoutine;
  pInformation->Ctrl_Info.Usb_wOffset = 0;
  (*CopyRoutine)(0);
  return USB_SUCCESS;
}

/*******************************************************************************
* Function Name  : CustomHID_NoData_Setup
* Description    : handle the no data class specific requests
* Input          : Request Nb.
* Output         : None.
* Return         : USB_UNSUPPORT or USB_SUCCESS.
*******************************************************************************/
RESULT CustomHID_NoData_Setup(uint8_t  RequestNo)
{
  if ((Type_Recipient == (CLASS_REQUEST | INTERFACE_RECIPIENT))
      && (RequestNo == SET_PROTOCOL))
  {
    return CustomHID_SetProtocol();
  }

  else
  {
    return USB_UNSUPPORT;
  }
}

/*******************************************************************************
* Function Name  : CustomHID_GetDeviceDescriptor.
* Description    : Gets the device descriptor.
* Input          : Length
* Output         : None.
* Return         : The address of the device descriptor.
*******************************************************************************/
uint8_t *CustomHID_GetDeviceDescriptor(uint16_t Length)
{
  return Standard_GetDescriptorData(Length, &Device_Descriptor);
}

/*******************************************************************************
* Function Name  : CustomHID_GetConfigDescriptor.
* Description    : Gets the configuration descriptor.
* Input          : Length
* Output         : None.
* Return         : The address of the configuration descriptor.
*******************************************************************************/
uint8_t *CustomHID_GetConfigDescriptor(uint16_t Length)
{	 
   return Standard_GetDescriptorData(Length, &Config_Descriptor);
   
}

/*******************************************************************************
* Function Name  : CustomHID_GetStringDescriptor
* Description    : Gets the string descriptors according to the needed index
* Input          : Length
* Output         : None.
* Return         : The address of the string descriptors.
*******************************************************************************/
uint8_t *CustomHID_GetStringDescriptor(uint16_t Length)
{
  uint8_t wValue0 = pInformation->USBwValue0;
  if (wValue0 > 4)
  {
    return NULL;
  }
  else
  {
    return Standard_GetDescriptorData(Length, &String_Descriptor[wValue0]);
  }
}

/*******************************************************************************
* Function Name  : CustomHID_GetReportDescriptor.
* Description    : Gets the HID report descriptor.
* Input          : Length
* Output         : None.
* Return         : The address of the configuration descriptor.
*******************************************************************************/
uint8_t *CustomHID_GetReportDescriptor(uint16_t Length)
{
  return Standard_GetDescriptorData(Length, &CustomHID_Report_Descriptor);
}


/*******************************************************************************
* Function Name  : CustomHID_GetMouseReportDescriptor.
* Description    : Gets the HID report descriptor.
* Input          : Length
* Output         : None.
* Return         : The address of the configuration descriptor.
*******************************************************************************/
#if 0
uint8_t *CustomHID_GetMouseReportDescriptor(uint16_t Length)
{
  return Standard_GetDescriptorData(Length, &CustomHID_Mouse_Report_Descriptor);
}
#endif
/*******************************************************************************
* Function Name  : CustomHID_GetHIDDescriptor.
* Description    : Gets the HID descriptor.
* Input          : Length
* Output         : None.
* Return         : The address of the configuration descriptor.
*******************************************************************************/
uint8_t *CustomHID_GetHIDDescriptor(uint16_t Length)
{
	//getreportcnt ++;
  return Standard_GetDescriptorData(Length, &CustomHID_Hid_Descriptor);
}
#if 0
uint8_t *CustomHID_GetHIDDescriptor1(uint16_t Length)
{
	//getreportcnt ++;
  return Standard_GetDescriptorData(Length, &CustomHID_Hid_Descriptor1);
}


uint8_t *CustomHID_GetHIDDescriptor2(uint16_t Length)
{
	//getreportcnt ++;
  return Standard_GetDescriptorData(Length, &CustomHID_Hid_Descriptor2);
}
#endif


/*******************************************************************************
* Function Name  : CustomHID_Get_Interface_Setting.
* Description    : tests the interface and the alternate setting according to the
*                  supported one.
* Input          : - Interface : interface number.
*                  - AlternateSetting : Alternate Setting number.
* Output         : None.
* Return         : USB_SUCCESS or USB_UNSUPPORT.
*******************************************************************************/
RESULT CustomHID_Get_Interface_Setting(uint8_t Interface, uint8_t AlternateSetting)
{
  if (AlternateSetting > 0)
  {
    return USB_UNSUPPORT;
  }
  else if (Interface > 0)
  {
    return USB_UNSUPPORT;
  }
  return USB_SUCCESS;
}

/*******************************************************************************
* Function Name  : CustomHID_SetProtocol
* Description    : Joystick Set Protocol request routine.
* Input          : None.
* Output         : None.
* Return         : USB SUCCESS.
*******************************************************************************/
RESULT CustomHID_SetProtocol(void)
{
  uint8_t wValue0 = pInformation->USBwValue0;
  ProtocolValue = wValue0;
  return USB_SUCCESS;
}

/*******************************************************************************
* Function Name  : CustomHID_GetProtocolValue
* Description    : get the protocol value
* Input          : Length.
* Output         : None.
* Return         : address of the protocol value.
*******************************************************************************/
uint8_t *CustomHID_GetProtocolValue(uint16_t Length)
{
  if (Length == 0)
  {
    pInformation->Ctrl_Info.Usb_wLength = 1;
    return NULL;
  }
  else
  {
    return (uint8_t *)(&ProtocolValue);
  }
}

/*******************************************************************************
* Function Name  : CustomHID_GetReport.
* Description    : Gets the device feature report.
* Input          : Length
* Output         : None.
* Return         : The address of the feature.
*******************************************************************************/
uint8_t *CustomHID_GetReport_Feature(uint16_t Length)
{
  //uint32_t  wOffset;
  //getreportcnt = pInformation->Ctrl_Info.Usb_wOffset;
  if (Length == 0)
  {
    pInformation->Ctrl_Info.Usb_wLength = 2;
    return 0;
  }
 //GetReportFlag = 1;
 //getreportcnt ++;
  HID_GetReport_Value[0] = pInformation->USBwValue0;
  HID_GetReport_Value[1] = TOUCH_DATA_COUNT;//0x02;
  return (HID_GetReport_Value);
}

/*******************************************************************************
* Function Name  : CustomHID_SetReport.
* Description    : Sets the device feature report.
* Input          : Length
* Output         : None.
* Return         : The address of the feature.
*******************************************************************************/
#if 0  /*zhaorui 130922 +*/ 
uint8_t *CustomHID_SetReport_Feature(uint16_t Length)
{
  //uint32_t  wOffset;
  //setreportcnt = pInformation->Ctrl_Info.Usb_wOffset;

  if (Length == 0)
  {
    pInformation->Ctrl_Info.Usb_wLength = 3;     //2
    return 0;
  }
  
  return (HID_SetReport_Value);  //04 02 78 3bytes data
}
#endif  /*  #if 0 -*/

extern uint8_t g_u8TouchMode;

uint8_t *CustomHID_SetReport_Feature(uint16_t Length)
{
  if (Length == 0)
  {
    pInformation->Ctrl_Info.Usb_wLength = 3;
	g_u8TouchMode = 2;// MULTI_MODE
	
	return 0;
  }
  
  return (HID_SetReport_Value);  //04 02 78 3bytes data
}


/******************* (C) COPYRIGHT 2009 STMicroelectronics *****END OF FILE****/
